tap "adoptopenjdk/openjdk"
tap "cisco-open/tap"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "modularml/packages"
tap "oven-sh/bun"
tap "samuelmeuli/tap"
tap "thoughtbot/formulae"
tap "wtfutil/wtfutil"
brew "aspell"
brew "automake"
brew "openssl@3"
brew "readline"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bison"
brew "glib"
brew "cfssl"
brew "cmake"
brew "cmark-gfm"
brew "coreutils"
brew "curl"
brew "deno"
brew "direnv"
brew "duckdb"
brew "editorconfig"
brew "enchant"
brew "fd"
brew "fend"
brew "gcc"
brew "sdl2"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "findutils"
brew "gdbm"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "google-java-format"
brew "gradle"
brew "grpcui"
brew "imagemagick"
brew "jq"
brew "k6"
brew "openssl@1.1"
brew "kcat"
brew "kotlin"
brew "libffi"
brew "libgccjit"
brew "libxml2"
brew "libyaml"
brew "luarocks"
brew "maven"
brew "media-info"
brew "multimarkdown"
brew "ncurses"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "tree"
brew "pass"
brew "pgcli"
brew "pgformatter"
brew "pkl"
brew "poppler"
brew "postgresql@16", link: true
brew "pspg"
brew "pyenv"
brew "qsv"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "sdl2_image"
brew "sdl2_ttf"
brew "swift-format"
brew "tmux"
brew "vim"
brew "volta"
brew "wabt"
brew "wasmtime"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "zoxide"
brew "zsh"
brew "cisco-open/tap/fsoc"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
brew "modularml/packages/modular"
brew "oven-sh/bun/bun"
brew "thoughtbot/formulae/rcm"
cask "alacritty"
cask "authy"
cask "cocoapods"
cask "iterm2"
cask "karabiner-elements"
cask "raycast"
cask "rectangle"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
vscode "golang.go"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
