tap "adoptopenjdk/openjdk"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "samuelmeuli/tap"
tap "thoughtbot/formulae"
tap "wtfutil/wtfutil"
brew "aspell"
brew "automake"
brew "gdbm"
brew "openssl@1.1"
brew "readline"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bison"
brew "glib"
brew "cfssl"
brew "cmake"
brew "cmark-gfm"
brew "coreutils"
brew "curl"
brew "deno"
brew "direnv"
brew "editorconfig"
brew "fd"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "google-java-format"
brew "gradle"
brew "jq"
brew "kotlin"
brew "libffi"
brew "libgccjit"
brew "libxml2"
brew "libyaml"
brew "maven"
brew "mitmproxy"
brew "multimarkdown"
brew "ncurses"
brew "neovim"
brew "nmap"
brew "node"
brew "node@14"
brew "nvm"
brew "tree"
brew "pass"
brew "pgcli"
brew "pgformatter"
brew "pspg"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "rust-analyzer"
brew "tmux"
brew "vim"
brew "wabt"
brew "wasmtime"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "zoxide"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
brew "thoughtbot/formulae/rcm"
cask "alacritty"
cask "authy"
cask "cocoapods"
cask "iterm2"
cask "karabiner-elements"
cask "raycast"
cask "rectangle"
