tap "adoptopenjdk/openjdk"
tap "azure/azd"
tap "azure/kubelogin"
tap "cisco-open/tap"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/services"
tap "modularml/packages"
tap "oven-sh/bun"
tap "samuelmeuli/tap"
tap "thoughtbot/formulae"
tap "wtfutil/wtfutil"
brew "aspell"
brew "automake"
brew "libyaml"
brew "openssl@3"
brew "readline"
brew "azure-cli"
brew "ncurses"
brew "bash"
brew "bat"
brew "bison"
brew "glib"
brew "cfssl"
brew "cmake"
brew "cmark-gfm"
brew "coreutils"
brew "curl"
brew "deno"
brew "direnv"
brew "duckdb"
brew "editorconfig"
brew "enchant"
brew "fd"
brew "sdl2"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "gh"
brew "git"
brew "gitui"
brew "gnupg"
brew "go"
brew "google-java-format"
brew "gradle"
brew "grpcui"
brew "helm"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "just"
brew "k3d"
brew "k6"
brew "kcat"
brew "kotlin"
brew "lazygit"
brew "libffi"
brew "libgccjit"
brew "libxml2"
brew "luarocks"
brew "maven"
brew "media-info"
brew "multimarkdown"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "node"
brew "numbat"
brew "ollama"
brew "tree"
brew "pass"
brew "pgcli"
brew "pgformatter"
brew "pkgconf"
brew "pkl"
brew "postgresql@16", restart_service: :changed, link: true
brew "protobuf"
brew "pspg"
brew "qsv"
brew "reattach-to-user-namespace"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "ruff"
brew "rust-analyzer"
brew "sdl2_image"
brew "sdl2_ttf"
brew "sk"
brew "starship"
brew "swift-format"
brew "telnet"
brew "tmux"
brew "trino"
brew "uv"
brew "volta"
brew "wabt"
brew "wasmtime"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "zoxide"
brew "zsh"
brew "azure/azd/azd"
brew "d12frosted/emacs-plus/emacs-plus@30"
brew "modularml/packages/modular"
brew "oven-sh/bun/bun"
brew "thoughtbot/formulae/rcm"
cask "brave-browser"
cask "font-sauce-code-pro-nerd-font"
cask "iterm2"
cask "karabiner-elements"
cask "mitmproxy"
cask "raycast"
cask "rectangle"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "wezterm@nightly"
vscode "docker.docker"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "marimo-team.vscode-marimo"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
